Repository: suryaishnavi/cashflow_v0.1
Catalog: lib/l10n/app_*.arb
Languages: te

# appTitle
source: Cashflow
te: క్యాష్ ఫ్లో

# welcomeScreen
source: {welcome, select, welcome{Welcome to Cashflow} appSubtitle{Empower Your Financial Empire} appDescription{Simplify your Finance Business with Cashflow - Seamlessly manage customers, loans, collections, and reports.} language{Your World, Your Words - Choose Your Preferred Language!} other{}}
te: {welcome, select, welcome{క్యాష్ ఫ్లోకు స్వాగతం} appSubtitle{మీ ఆర్థిక సామ్రాజ్యాన్ని శక్తివంతం చేయండి} appDescription{క్యాష్ ఫ్లోతో మీ ఫైనాన్స్ వ్యాపారాన్ని సులభతరం చేయండి - కస్టమర్ లు, రుణాలు, కలెక్షన్లు మరియు రిపోర్టులను సజావుగా నిర్వహించండి.} language{మీ ప్రపంచం, మీ పదాలు - మీకు ఇష్టమైన భాషను ఎంచుకోండి!} other{}}

# wait
source: Please wait
te: దయచేసి వేచి ఉండండి

source: Sign In
te: సైన్ ఇన్

# create
source: Create Account
te: ఖాతా సృష్టించండి

# welcome
source: Welcome back!
te: మీకు స్వాగతం

# name
source: Full Name
te: పేరు

# nameHint
source: Enter your full name
te: పేరు నమోదు చేయండి

# nameError
source: Invalid name
te: పేరు తప్పనిసరిగా ఉండాలి

# email
source: Email address
te: ఇమెయిల్ ఐడి

# emailHint
source: Enter your email address
te: ఇమెయిల్ ఐడి నమోదు చేయండి

# emailError
source: Invalid email address
te: చెల్లని ఇమెయిల్ చిరునామా

# mobile
source: Mobile number
te: ఫోన్ నంబర్

# mobileHint
source: Enter your mobile number
te: ఫోన్ నంబర్ నమోదు చేయండి

# mobileError
source: Invalid mobile number
te: చెల్లని ఫోన్ నంబర్

source: Password
te: పాస్వర్డ్

# passwordHint
source: Enter your password
te: పాస్వర్డ్ నమోదు చేయండి

# passwordError
source: Password must be at least 8 characters long
te: పాస్‌వర్డ్ తప్పనిసరిగా కనీసం 8 అక్షరాల పొడవు ఉండాలి

source: Forgot Password?
te: పాస్వర్డ్ మర్చిపోయారా?

source: New Password
te: కొత్త పాస్వర్డ్

source: Submit
te: సమర్పించు

source: Confirm
te: నిర్ధారించండి

source: Close
te: మూసివేయి

source: Cancel
te: రద్దు చేయి

# signup
source: Create Account
te: ఖాతా సృష్టించు

source: Sign Out
te: సైన్ అవుట్

source: Language
te: భాష

source: Delete
te: తొలగించు

source: Add
te: జోడించు

# emiTable
source: Installments Table
te: వాయిదాల పట్టిక

# number
source: No.
te: సంఖ్య

source: Date
te: తేదీ

source: Due Date
te: వాయిదా గడువు తేదీ

# installmentDate
source: Due on
te: వారాలు

source: Paid Date
te: చెల్లింపు తేదీ

source: Paid Amount
te: చెల్లింపు మొత్తం

# loanDate
source: Loan Given Date
te: అప్పు ఇచ్చిన తేదీ

# loanEnd
source: Loan End Date
te: రుణ ముగింపు తేదీ

source: Confirm Loan Details
te: లోన్ వివరాలు నిర్ధారించండి

source: EMI Paid
te: చెల్లింపు మొత్తం

source: Amount
te: డబ్బు

source: Given Amount
te: ఇచ్చిన డబ్బు

source: Balance
te: బాకీ మొత్తం

# totalInstallments
source: Total Payments
te: మొత్తం వాయిదాలు

# installmentAmount
source: Per Installment
te: వాయిదా కి

source: Current Installment
te: ప్రస్తుత వాయిదా

source: Paid Installments
te: చెల్లించిన వాయిదాలు

# gettingData
source: Please wait... We are getting your data
te: దయచేసి వేచి ఉండండి... మేము మీ డేటాను లోడ్ చేస్తున్నాము

# greet
source: Hi, {userName}
te: హాయ్, {userName}

# circle
source: Circles
te: లైన్లు

source: Select Circle
te: లైన్ ఎంచుకోండి

source: Reports
te: రిపోర్టులు

# profile
source: {Profile, select, name{Profile} name2{Your Profile} other{}}
te: {Profile, select, name{ప్రొఫైల్} name2{మీ ప్రొఫైల్} other{}}

# yourCircle
source: Your Circles
te: మీ లైన్లు

source: Add Circle
te: లైన్లు జోడించు

source: Select City
te: నగరాన్ని ఎంచుకోండి

source: All Cities
te: అన్నీ నగరాలు

# noCities
source: No cities found
te: మీరు ఇంకా నగరాలను సృష్టించనట్లు కనిపిస్తోంది.

source: Add New City
te: కొత్త నగరాన్ని జోడించండి

source: City Name
te: నగరం పేరు

# cityNameHint
source: Enter City Name
te: నగరం పేరు నమోదు చేయండి

# cityNameError
source: City Name should be more than 3 characters
te: నగరం పేరు తప్పనిసరిగా 3 అక్షరాలు కంటే ఎక్కువ ఉండాలి

source: Circle Name
te: లైన్ పేరు

# circleNameHint
source: Enter Circle Name
te: లైన్ పేరు నమోదు చేయండి

# circleNameError
source: Circle Name should be more than 3 characters
te: లైన్ పేరు తప్పనిసరిగా 3 అక్షరాలు కంటే ఎక్కువ ఉండాలి

# errorMsg
source: Something went wrong
te: ఎక్కడో తప్పు జరిగింది. మళ్లీ లోడ్ చేయడానికి ప్రయత్నించండి.

# tryAgain
source: Please try again
te: దయచేసి మళ్లీ ప్రయత్నించండి

# createCircleBtn
source: CreateCircle
te: లైన్ సృష్టించు

# noCircle
source: Hi there! Click the 'Create Circle' button below to make a new circle and get started.
te: హాయ్! కొత్త లైన్‌ను రూపొందించడానికి మరియు ప్రారంభించడానికి 'లైన్ సృష్టించు' బటన్‌ను నొక్కండి.

# circleType
source: Weekly, Daily or Monthly
te: వారానికోసారి, రోజువారీ లేదా నెలవారీ

# getWeekDay
source: {weekDay, select, SUNDAY{Sunday} MONDAY{Monday} TUESDAY{Tuesday} WEDNESDAY{Wednesday} THURSDAY{Thursday} FRIDAY{Friday} SATURDAY{Saturday} DAILY{Daily} MONTHLY{Monthly} other{}}
te: {weekDay, select, SUNDAY{ఆదివారం} MONDAY{సోమవారం} TUESDAY{మంగళవారం} WEDNESDAY{బుధవారం} THURSDAY{గురువారం} FRIDAY{శుక్రవారం} SATURDAY{శనివారం} DAILY{రోజువారీ} MONTHLY{నెలవారీ} other{}}

source: Generate Report
te: రిపోర్టు సృష్టించు

source: Retry
te: రిట్రీ

# noCirclesFound
source: It appears that you haven''t created any circles yet.
te: మీరు ఇంకా ఏ లైన్ సర్కిల్‌లను సృష్టించనట్లు కనిపిస్తోంది.

# noInternet
source: Unable to connect to a network
te: నెట్‌వర్క్‌కు కనెక్ట్ చేయడం సాధ్యం కాలేదు

# connected
source: Connected to a network
te: నెట్‌వర్క్‌కు కనెక్ట్ చేయబడింది

source: Preview
te: ప్రివ్యూ

# subscription
source: Subscription Details
te: చెల్లింపు వివరాలు

source: Status
te: స్థితి

source: End Date
te: చివరి తేదీ

source: Upgrade
te: అప్ గ్రేడ్

# settings
source: App Settings
te: యాప్ సెట్టింగ్‌లు

source: Customers
te: ఖాతాదారులు

# sortCustomer
source: Sort Customers by City
te: నగరాల వారీగా కస్టమర్లను క్రమబద్ధీకరించండి

# noCustomers
source: It''s empty here add your first customer by tapping the '+AddCustomer' button below
te: క్రింద ఉన్న '+ఖాతాదారుని జోడించండి' బటన్ నొక్కడం ద్వారా మీ మొదటి కస్టమర్ ని జోడించండి

source: Add Customer
te: ఖాతాదారుని జోడించండి

source: Customer Name
te: ఖాతాదారుని పేరు

# customerNameHint
source: Enter Customer Name
te: ఖాతాదారుని పేరు నమోదు చేయండి

# customerNameError
source: Customer Name should be more than 3 characters
te: ఖాతాదారుని పేరు తప్పనిసరిగా 3 అక్షరాలు కంటే ఎక్కువ ఉండాలి

source: Customer Mobile
te: ఖాతాదారుని మొబైల్

# customerMobileHint
source: Enter Customer Mobile
te: ఖాతాదారుని మొబైల్ నంబర్ నమోదు చేయండి

# customerMobileError
source: Customer Mobile should be more than 3 characters
te: ఖాతాదారుని మొబైల్ నంబర్ తప్పనిసరిగా ఉండాలి

# showCustomerProfile
source: Customer Profile
te: ఖాతాదారుని ప్రొఫైల్

# call
source: Call to Customer
te: కాల్ చేయండి

# createLoan
source: {createLoan, select, name{Create Loan} new{New Loan} old{Old Loan} additional{Additional Loan} other{}}
te: {createLoan, select, name{లోన్ సృష్టించండి} new{కొత్త లోన్} old{పాత లోన్} additional{అదనపు రుణం} other{}}

source: Loan Details
te: లోన్ వివరాలు

source: Active Loans
te: క్రియాశీల లోన్‌లు

source: Loan Book ID
te: లోన్ పుస్తకం ఐడీ

source: Closed Loans
te: ముగిసిన లోన్‌లు

# loanUpdateSuccess
source: Loan Updated Successfully
te: లోన్ అప్‌డేట్ చేయబడింది

source: Loan Update Failed
te: లోన్ అప్‌డేట్ చేయడం విఫలమైంది

# noLoans
source: No Loans Found
te: మీరు ఇంకా లోన్‌లను సృష్టించనట్లు కనిపిస్తోంది.

# daysLeft
source: days left to Delete
te: తొలగించడానికి రోజులు మిగిలి ఉన్నాయి

# noEmis
source: No EMIs Found
te: ఈ లోన్ కోసం ఇంకా ఏ వాయిదాలు లేవు.

source: Update Collection Amount
te: కలెక్షన్ అమౌంట్ నవీకరించు

source: Enter Collection Amount
te: కలెక్షన్ అమౌంట్ నమోదు చేయండి

# loanCloseReason
source: Closed by the AppUser
te: వినియోగదారు ద్వారా మూసివేయబడింది

source: Loan Closed
te: లోన్ ముగిసింది

source: Warning
te: హెచ్చరిక

# loanCloseWarning
source: Do you want to close this loan? If you do, your Loan data will be deleted in the next 30 days and you won''t be able to undo it.
te: మీరు ఈ రుణాన్ని క్లోజ్ చేయాలని అనుకుంటున్నారా? ఒకవేళ మీరు అలా చేస్తే, రాబోయే 30 రోజుల్లో మీ లోన్ డేటా తొలగించబడుతుంది మరియు మీరు దానిని రద్దు చేయలేరు.

source: Close loan
te: లోన్ ముగించు

# loanRefinancing
source: Loan Refinance
te: లోన్ రిఫైనాన్సింగ్

source: Change Loan Amount
te: లోన్ అమౌంట్ మార్చు

# loanCreated
source: Loan Created Successfully
te: లోన్ విజయవంతంగా సృష్టించబడింది

# difference
source: {days, select, yesterday{Due Yesterday} today{Due Today} tomorrow{Due Tomorrow} positive{days remaining} negative{days overdue} other{they}}
te: {days, select, yesterday{నిన్న చెల్లించాల్సి ఉంది} today{ఈరోజు గడువు} tomorrow{రేపు గడువు} positive{మిగిలి ఉన్న రోజులు} negative{రోజులు గడిచిపోయాయి} other{}}

source: Loan Repayments
te: లోన్ చెల్లింపులు

# payEmiBtn
source: Pay EMI
te: వాయిదా చెల్లింపు

# labelRepaymentAmount
source: Enter Repayment Amount
te: తిరిగి చెల్లించే మొత్తాన్ని నమోదు చేయండి

# hintRepaymentAmount
source: Enter Repayment Emi Amount
te: తిరిగి చెల్లించే వాయిదా మొత్తాన్ని నమోదు చేయండి

source: No Active Loans
te: క్రియాశీల రుణాలు లేవు

# inActiveCustomer
source: There are no active loans for this customer. You can mark this customer as inactive. This customer will automatically become active when you give a new loan
te: ఈ కస్టమర్ కి ఎలాంటి క్రియాశీల రుణాలు లేవు. ఈ కస్టమర్ ని ఇన్ యాక్టివ్ గా మీరు మార్క్ చేయవచ్చు. మీరు కొత్త లోన్ ఇచ్చినప్పుడు ఈ కస్టమర్ ఆటోమేటిక్ గా యాక్టివ్ అవుతాడు

source: Mark Inactive
te: ఇన్ యాక్టివ్ మార్క్ చేయి

source: Update Amount
te: అమౌంట్ నవీకరించు

# updateAmountLabel
source: Enter New Amount
te: కొత్త మొత్తాన్ని నమోదు చేయండి

# updateAmountHint
source: Enter New Emi Amount
te: కొత్త వాయిదా మొత్తాన్ని నమోదు చేయండి

# updateAmountError
source: Please enter a valid emi amount
te: దయచేసి చెల్లుబాటు అయ్యే వాయిదా మొత్తాన్ని నమోదు చేయండి

# createCustomer
source: {createCustomer, select, name{Create Customer} new{New Customer} old{Old Customer} other{}}
te: {createCustomer, select, name{కస్టమర్‌ని సృష్టించండి} new{కొత్త ఖాతాదారు} old{పాత ఖాతాదారు} other{}}

# identityField
source: {identityField, select, label{Unique ID (Aadhar Card)} hint{Enter 12 Digit Aadhar Number} error{Please enter Aadhaar Card Number} alreadyExists{Customer already exists} other{}}
te: {identityField, select, label{యూనిక్ ఐడీ (ఆధార్ కార్డు)} hint{12 అంకెల ఆధార్ నంబర్‌ను నమోదు చేయండి} error1{దయచేసి ఆధార్ కార్డు నెంబరు నమోదు చేయండి} error2{కస్టమర్ ఇప్పటికే ఉన్నారు} other{}}

# nameField
source: {nameField, select, label{Customer Name} hint{Enter Customer Name} error{Please enter Customer Name} other{}}
te: {nameField, select, label{కస్టమర్ పేరు} hint{కస్టమర్ పేరు నమోదు చేయండి} error{దయచేసి కస్టమర్ పేరు నమోదు చేయండి} other{}}

# mobileNumberField
source: {mobileNumberField, select, label{Mobile Number} hint{Enter Mobile Number} error{Please enter 10 Digit Mobile Number} other{}}
te: {mobileNumberField, select, label{మొబైల్ నంబర్} hint{మొబైల్ నంబర్ నమోదు చేయండి} error{దయచేసి 10 అంకెల మొబైల్ నంబర్‌ని నమోదు చేయండి} other{}}

# addressField
source: {addressField, select, label{Customer Address} hint{Enter Customer Address} error{Please enter Address} other{}}
te: {addressField, select, label{కస్టమర్ చిరునామా} hint{కస్టమర్ చిరునామాను నమోదు చేయండి} error{దయచేసి చిరునామా నమోదు చేయండి} other{}}

# loanIdField
source: {loanIdField, select, label{Loan Book Id} hint{Enter Loan Book Id} error{Please enter Loan ID} other{}}
te: {loanIdField, select, label{లోన్ పుస్తకం ఐడీ} hint{లోన్ పుస్తకం ఐడీ నమోదు చేయండి} error{దయచేసి లోన్ పుస్తకం ఐడీ నమోదు చేయండి} other{}}

# totalGivenAmountField
source: {totalGivenAmountField, select, label{Only Enter Given Amount} hint{Enter only Given Amount} error{Please enter Given Amount} error2{Given Amount is less then 100} other{}}
te: {totalGivenAmountField, select, label{ఇవ్వబడ్డ మొత్తాన్ని మాత్రమే నమోదు చేయండి} hint{ఇచ్చిన డబ్బు} error{దయచేసి మొత్తం ఇచ్చిన డబ్బు నమోదు చేయండి} error2{ఇచ్చిన మొత్తం 100 కంటే తక్కువ} other{}}

# installmentAmountField
source: {installmentAmountField, select, label{Installment Amount} hint{Enter Installment Amount} error{Please enter Installment Amount} error2{Installment Amount is less then 50} other{}}
te: {installmentAmountField, select, label{వాయిదా మొత్తాన్ని నమోదు చేయండి} hint{ప్రతి వాయిదా కి} error{దయచేసి వాయిదా మొత్తం నమోదు చేయండి} error2{వాయిదా మొత్తం 100 కంటే తక్కువ} other{}}

# totalInstallmentsField
source: {totalInstallmentsField, select, label{Total Installments} hint{Enter Total Installments (12)} error{Please enter Total Installments} error2{Total EMIs is less then 1} error3{Total installments is not more than 200} other{}}
te: {totalInstallmentsField, select, label{మొత్తం వాయిదాలు నమోదు చేయండి} hint{మొత్తం వాయిదాలు (12)} error{దయచేసి మొత్తం వాయిదాలు నమోదు చేయండి} error2{మొత్తం వాయిదాలు 1 కంటే తక్కువ} error3{మొత్తం వాయిదాలు 200కు మించరాదు} other{}}

# paidInstallmentsField
source: {paidInstallmentsField, select, label{Paid Installments} hint{Enter Paid Installments (6)} error{Please enter Paid Installments} error2{Paid Installments is less then 0} error3{Paid installments is not more than 200} error4{Paid installments are greater then Total installments} error5{Total installments are required} other{}}
te: {paidInstallmentsField, select, label{చెల్లించిన వాయిదాలు నమోదు చేయండి} hint{చెల్లించిన వాయిదాలు (6)} error{దయచేసి చెల్లించిన వాయిదాలు నమోదు చేయండి} error2{చెల్లించిన వాయిదాలు 1 కంటే తక్కువ} error3{చెల్లించిన వాయిదాలు 200కు మించరాదు} error4{చెల్లించిన వాయిదాలు మొత్తం వాయిదాల కంటే ఎక్కువ} error5{మొత్తం వాయిదాలు అవసరం} other{}}

source: Collectible Amount
te: చెల్లించవలసిన మొత్తం

# loanCreationError
source: Unable to create Loan please try again
te: లోన్‌ని సృష్టించడం సాధ్యం కాలేదు, దయచేసి మళ్లీ ప్రయత్నించండి

source: Enter New Loan Details
te: కొత్త లోన్ వివరాలను నమోదు చేయండి

source: Enter Existing Loan Details
te: పాత లోన్ వివరాలను నమోదు చేయండి

# scanAadhar
source: Scan Aadhaar QR
te: ఆధార్ QRని స్కాన్ చేయండి

# aadhaarscanInfo
source: All aadhaar card data may not scan properly, please fill the form manually
te: అన్ని ఆధార్ కార్డ్ డేటా సరిగ్గా స్కాన్ కాకపోవచ్చు, దయచేసి స్కాన్ చేయకపోతే మాన్యువల్‌గా ఫారమ్‌ను పూరించండి

source: Scan
te: స్కాన్ చేయండి

# confirmPageTxt
source: {confirmPageTxt, select, welcome{Welcome to Cashflow! You have successfully created your account.} confirm{Confirm your email account} verfication{We have sent a 6-digit verification code to} resend{Didn''t receive the code?} label{Confirmation Code} hint{Enter 6-digit verification code} btnTxt{Confirm} newCodeSent{A new Verification code sent} resendTxt{Resend Code} sentTxt{code sent} backToSignIn{Back to Sign In} other{}}
te: {confirmPageTxt, select, welcome{క్యాష్ ఫ్లోకు స్వాగతం! మీరు మీ ఖాతాను విజయవంతంగా సృష్టించారు.} confirm{మీ ఇమెయిల్ ఖాతాను ధృవీకరించండి} verfication{మేము 6-అంకెల ధృవీకరణ కోడ్‌ని పంపాము} resend{కోడ్ అందలేదా?} label{ధృవీకరణ కోడ్} hint{6-అంకెల ధృవీకరణ కోడ్‌ను నమోదు చేయండి} newCodeSent{కొత్త ధృవీకరణ కోడ్ పంపబడింది} resendTxt{కోడ్‌ని మళ్లీ పంపండి} sentTxt{కోడ్ పంపబడింది} backToSignIn{సైన్ ఇన్ చేయడానికి తిరిగి వెళ్లండి} other{}}

# resetPasswordPageTxt
source: {resetPasswordPageTxt, select, heading{Reset Password} valid{Please enter valid email} title{Enter your Email} label{Email Address} hint{Enter your email address} title2{Enter New Password & OTP} otpField{Enter the OTP sent to your email address} label2{New Password} hint2{Enter your new password} label3{OTP} hint3{Enter your OTP} passwordBtnTxt{Password Changed} other{}}
te: {resetPasswordPageTxt, select, heading{రీసెట్ పాస్వర్డ్} valid{దయచేసి సరైన ఈమెయిల్ ఇవ్వండి} title{మీ ఇమెయిల్‌ను నమోదు చేయండి} label{ఇమెయిల్ చిరునామా} hint{మీ ఈ మెయిల్ వివరాలని నమోదు చేయండి} title2{కొత్త పాస్ వర్డ్ మరియు OTP ఎంటర్ చేయండి} otpField{మీ ఇమెయిల్ చిరునామాకు పంపిన OTPని నమోదు చేయండి} label2{కొత్త పాస్వర్డ్} hint2{మీ కొత్త పాస్‌వర్డ్‌ని నమోదు చేయండి} label3{OTP} hint3{మీ OTPని నమోదు చేయండి} passwordBtnTxt{పాస్‌వర్డ్ మార్చబడింది} other{}}

# deleteOptionsTxt
source: {deleteOptionsTxt, select, delLoan{Delete Loan} delLoanPopupHeading{Are you sure you want to delete this loan?} delCustomer{Delete Customer} delCustomerMsg{Are you sure you want to delete this customer?} delCircle{Delete Circle} delCircleMsg{Are you sure you want to delete this Circle?} delCity{Delete City} delUser{Delete App User} delete{Delete} other{}}
te: {deleteOptionsTxt, select, delLoan{లోన్ తొలగించండి} delLoanPopupHeading{మీరు ఈ రుణాన్ని ఖచ్చితంగా తొలగించాలనుకుంటున్నారా?} delCustomer{ఖాతాదారుని తొలగించండి} delCustomerMsg{మీరు ఈ ఖాతాదారుని ఖచ్చితంగా తొలగించాలనుకుంటున్నారా?} delCircle{లైన్ తొలగించండి} delCircleMsg{మీరు ఖచ్చితంగా ఈ లైన్ ని తొలగించాలనుకుంటున్నారా?} delCity{నగరాన్ని తొలగించండి} delUser{యాప్ వినియోగదారుని తొలగించండి} delete{తొలగించండి} other{}}
